labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
      //TimeForSlowRunGPRS=HAL_GetTick();
    }
    
    
    

    //###########################################
    #endif
    //###########################################
    for(uint8_t i=0 ;i<sizeof(Sim80x.Gsm.HaveNewMsg) ; i++)
    {
      if(Sim80x.Gsm.HaveNewMsg[i] > 0)
      {
        //getSmsMsgMemorySts();        
        if(getSmsMsg(Sim80x.Gsm.HaveNewMsg[i])==true)
        {
					delay_ms(100);
          smsUserNewMsg(Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);
					delay_ms(100);
          deleteSmsMsg(Sim80x.Gsm.HaveNewMsg[i]);
					delay_ms(100);
        }
        getSmsMsgMemorySts();  
        Sim80x.Gsm.HaveNewMsg[i]=0;
      }        
    }    
    //###########################################
    if(Sim80x.Gsm.MsgUsed > 0)
    {   
      if(getSmsMsg(UnreadMsgCounter)==true)
      {
        smsUserNewMsg(Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);
        deleteSmsMsg(UnreadMsgCounter);
        getSmsMsgMemorySts();
      }
      UnreadMsgCounter++;
      if(UnreadMsgCounter==150)
        UnreadMsgCounter=0;      
    }
    //###########################################
    if(Sim80x.Gsm.HaveNewCall == 1)
    {
      Sim80x.Gsm.GsmVoiceStatus = GsmVoiceStatus_Ringing;
      Sim80x.Gsm.HaveNewCall = 0;
     }    
    //###########################################
    //if(HAL_GetTick() - TimeForSlowRun > 20000)
    {
      sim800c.sendAtCommand("AT+CSQ\r\n",200,1,"\r\n+CSQ:");  
      sim800c.sendAtCommand("AT+CBC\r\n",200,1,"\r\n+CBC:"); 
      sim800c.sendAtCommand("AT+CREG?\r\n",200,1,"\r\n+CREG:");  
      getSmsMsgMemorySts();      
      //TimeForSlowRun=HAL_GetTick();
    }
    //###########################################
    //Gsm_User(HAL_GetTick());
    //###########################################
    delay_ms(100);
    
  }    
}

/****************************************************************
*FUNCTION NAME:setAtMode
*FUNCTION     :setAtMode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setAtMode(void)
{
  uint8_t answer;
  delay_ms(1000);       // prerequisite for switching to At Command Mode
  answer = sim800c.sendAtCommand("+++\r\n",200, 0);
  delay_ms(1000);     // prerequisite for switching to At Command Mode
  debugTerminal("setAtMode");

  if(answer == 1)
      return true;
  else
      return false;
}

/****************************************************************
*FUNCTION NAME:setDataMode
*FUNCTION     :setDataMode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setDataMode(void)
{
  uint8_t answer;  
  answer =sim800c.sendAtCommand("ATO\r\n",200, 0);
  debugTerminal("setDataMode");

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setActiveProfile
*FUNCTION     :setActiveProfile
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setActiveProfile(void)
{

}

/****************************************************************
*FUNCTION NAME:setDefaultConfig
*FUNCTION     :setDefaultConfig
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setDefaultConfig(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("ATZ\r\r",200, 0);

  debugTerminal("setDefaultConfig");

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setFactoryDefault
*FUNCTION     :setFactoryDefault
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setFactoryDefault(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT&F0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setAtEcho
*FUNCTION     :change command echo mode
*INPUT        :turnon
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setAtEcho(bool turnon)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "ATE%d\r\n", turnon); 
  
  int8_t answer;
  answer = sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setAtEcho");//need to check as response changes can be on or off

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

  if(answer == 1)
      return true;
  else
      return false;


}

/****************************************************************
*FUNCTION NAME:setBaudRate
*FUNCTION     :AT command to change baud rate
*INPUT        :baudrate
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setBaudRate(uint16_t baudrate)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+IPR=%d\r\n", baudrate); 
  
  int8_t answer;
  answer = sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setBaudRate");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setPower
*FUNCTION     :setPower
*INPUT        :turnon
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::setPower(bool turnon)
{ 
  if(turnon==true)
  {  
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      delay_ms(100);
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=1;
      //initValue();
    }
    else
    {     
      #if (_SIM80X_USE_POWER_KEY==1)  
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      delay_ms(3000);  
      if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
      {
        delay_ms(10000);
        #if (_SIM80X_DEBUG==1)
        printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
        #endif
        Sim80x.Status.Power=1;
        //initValue();   
      }
      else
        Sim80x.Status.Power=0;
    }
  }
  else
  {
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(OFF) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=0;
      #if (_SIM80X_USE_POWER_KEY==1) 
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      #if (_SIM80X_USE_POWER_KEY==0)
      sim800c.sendAtCommand("AT+CPOWD=1\r\n",2000,1,"\r\nOK\r\n"); 
      #endif      
    }
  }  
}

/****************************************************************
*FUNCTION NAME:saveParameters
*FUNCTION     :saveParameters
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool   LIB_SIM800C::setParameters(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT&W0\r\n",200,1,"AT&W0\r\r\nOK\r\n");
  debugTerminal("setParameters()");

