labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getManNo
*FUNCTION     :getManNo 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getManNo(void)
{  
  uint8_t answer;
  answer =sim800c.sendAtCommand("AT+CGMI\r\n",200,0);

  debugTerminal("Sim80x_getManNo");

  //update
  
  if(answer == 1)
      return true;
  else
      return false;
}

/****************************************************************
*FUNCTION NAME:getModelNo
*FUNCTION     :getModelNo 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getModelNo(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CGMM\r\n",200,0);

  debugTerminal("Sim80x_getModelNo");

  //update
  

  if(answer == 1)
      return true;
  else
      return false;


  
}

/****************************************************************
*FUNCTION NAME:getGlobalNo
*FUNCTION     :getGlobalNo 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getGlobalNo(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+GOI\r\n",200,0);

  debugTerminal("Sim80x_getGlobalNo");

  //update
  


  if(answer == 1)
      return true;
  else
      return false;

  
}

/****************************************************************
*FUNCTION NAME:getLastCommand
*FUNCTION     :getLastCommand 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getLastCommand(void)
{
   sim800c.sendAtCommand("A/",200, 0);
   //RESPONSE CANT BE DETERMINED
}

/****************************************************************
*FUNCTION NAME:getCurrentConfig
*FUNCTION     :getCurrentConfig 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getCurrentConfig(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT&V0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  //update
  
  

  if(answer == 1)
      return true;
  else
      return false;


  
}

/****************************************************************
*FUNCTION NAME:getTaCapabilities
*FUNCTION     :getTaCapabilities 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getTaCapabilities(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+GCAP\r\n",200,0);

  debugTerminal("Sim80x_getTaCapabilities");

  //update
  

  if(answer == 1)
      return true;
  else
      return false;


}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :recieve module IMEI number 
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getIMEI(char *IMEI)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CGSN\r\n",200, 0);

  processIMEI(1);

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getTeChar
*FUNCTION     :getTeChar 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getTeChar(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CSCS?\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :recieve module IMEI number 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getAddrsType(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CSTA?\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getIMSI
*FUNCTION     :getIMSI 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getIMSI(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CIMI\r\n",200, 0);

  //update
  

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getSelOperator
*FUNCTION     :getSelOperator
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getOperator(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+COPS?\r\n",120000, 0);

  //update
  

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getNetworkReg
*FUNCTION     :getNetworkReg 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getNetworkReg(void)
{
  uint8_t answer;
  answer =sim800c.sendAtCommand("AT+CREG?\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;
}

/****************************************************************
*FUNCTION NAME:getRLPParams
*FUNCTION     :getRLPParams
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::getRLPParams(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CRLP?\r\n",200, 0);
  debugTerminal("setRLPParams");
  //update
  

