labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getCSQ
*FUNCTION     :getCSQ 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getCSQ(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CSQ\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getPrefOperLst
*FUNCTION     :getPrefOperLst 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getPrefOperLst(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CPOL?\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getOperName
*FUNCTION     :getOperName 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getOperName(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+COPN\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getPhoneFunc
*FUNCTION     :getPhoneFunc 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getPhoneFunc(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CFUN?\r\n",10000, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getClockData
*FUNCTION     :getClockData
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::getClockData(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CCLK?\r\n",200, 0);
  debugTerminal("setClockData");

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:getBattChar
*FUNCTION     :getBattChar 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getBattChar(void)
{
  
  int8_t answer;
  answer = sim800c.sendAtCommand("AT+CBC\r\n",200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setTeChar
*FUNCTION     :setTeChar
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setTeChar(char *chset)
{
  uint8_t answer;
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CSCS%s\r\n", chset);
  answer = sim800c.sendAtCommand(temp, 200, 0);
  debugTerminal("setTeChar");


  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setAddrsType
*FUNCTION     :setAddrsType
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setAddrsType(uint8_t type)
{
  char temp[20];
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CSTA=%d\r\n", type); 
  answer = sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setAddrsType");

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setSelOperator
*FUNCTION     :setSelOperator
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setSelOperator(uint8_t mode, uint8_t format, uint8_t oper)
{
  char temp[20];
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+COPS=%d,[%d[],%d]]\r\n", mode, format, oper); 
  answer = sim800c.sendAtCommand(temp,120000, 0);
  debugTerminal("setSelOperator");

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setNetworkReg
*FUNCTION     :setNetworkReg
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setNetworkReg(bool turnon)
{
  char temp[20];  
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CREG=%d\r\n", turnon); 
  answer = sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setNetworkReg");
  processNetworkReg(1);

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setRLPParams
*FUNCTION     :setRLPParams 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::setRLPParams(uint16_t iws,uint16_t mws,uint16_t t2,uint16_t n2,uint16_t t4)
{
  char temp[20];  
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CRLP=%d[,%d[,%d[,%d[,%d]]]]\r\n", iws, mws, t2, n2, t4); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setPrefOperLst
*FUNCTION     :setPrefOperLst
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setPrefOperLst(uint8_t index, uint8_t  format, char *oper)
{
  char temp[20];
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CPOL=%d[,%d,%s]\r\n", index, format, oper); 
  answer = sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setPrefOperLst");

