labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setPhoneFunc
*FUNCTION     :setPhoneFunc
*INPUT        :fun, rst
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setPhoneFunc(uint8_t fun, uint8_t  rst)
{
  char temp[20];
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CFUN=%d[,%d]\r\n", fun, rst); 
  answer = sim800c.sendAtCommand(temp,10000, 0);
  debugTerminal("setPhoneFunc");

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setClockData
*FUNCTION     :setClockData 
*INPUT        :void
*OUTPUT       :time
****************************************************************/
bool  LIB_SIM800C::setClockData(char time)
{
  char temp[40];  
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CCLK=%s\r\n", time); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  //update

  if(answer == 1)
      return true;
  else
      return false;

}

/****************************************************************
*FUNCTION NAME:setSimAccess
*FUNCTION     :setSimAccess
*INPUT        :void
*OUTPUT       :length, command
****************************************************************/
bool LIB_SIM800C::setSimAccess(uint16_t length, char command)
{
  char temp[20];
  int8_t answer;
  snprintf(temp, sizeof(temp), "AT+CSIM=%d,%s\r\n", length, command); 
  answer = sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setSimAccess");

  if(answer == 1)
      return true;
  else
      return false;

}



/****************************************************************
*FUNCTION NAME:processManNo
*FUNCTION     :processManNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processManNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGMI\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGMI\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getManNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processModelNo
*FUNCTION     :processModelNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processModelNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGMM\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGMM\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getModelNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}//complete

/****************************************************************
*FUNCTION NAME:processGlobalNo
*FUNCTION     :processGlobalNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processGlobalNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GOI\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GOI\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getGlobalNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processLastCommand
*FUNCTION     :processLastCommand
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processLastCommand(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"A/\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"A/\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getLastCommand");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processCurrentConfig
*FUNCTION     :processCurrentConfig
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processCurrentConfig(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT&V0\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT&V0\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getCurrentConfig");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processTaCapabilities(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GCAP\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GCAP\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getTaCapabilities");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processNetworkReg(uint16_t addrs)
{
  
  char      *strStart, *str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

