labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processCSQ(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  str1 = strstr(strStart,"\r\n+CREG:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,',');
    str1++;
    if(atoi(str1)==1)
      Sim80x.Status.RegisterdToNetwork=1;
    else
      Sim80x.Status.RegisterdToNetwork=0;
  }
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processCBC(uint16_t addrs)
{
  
  char      *strStart,*str1;
  uint32_t tmp_int32_t;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
 //##################################################
  str1 = strstr(strStart,"\r\n+CBC:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    tmp_int32_t = atoi(str1);
    if(tmp_int32_t==0)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==1)
    {
      Sim80x.Status.BatteryCharging=1;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==2)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=1;
    }
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryPercent = atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryVoltage = atof(str1)/1000;      
  }
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsgTxt(char *number, char *msg, uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
 //##################################################  
  str1 = strstr(strStart,"\r\n+CMGS:");
  if(str1!=NULL)
  {
    Sim80x.Gsm.MsgSent=1;
  }  
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsgMemorySts(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
//##################################################  
  str1 = strstr(strStart,"\r\n+CPMS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    str1++;
    if(*str1 == '"')
    {
      str1 = strchr(str1,',');
      str1++;
    }
    Sim80x.Gsm.MsgUsed = atoi(str1);
    str1 = strchr(str1,',');
    str1++;      
    Sim80x.Gsm.MsgCapacity = atoi(str1);
  }  
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsg(uint16_t addrs)
{
  
  char      *strStart,*str1;
  uint32_t tmp_int32_t;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CMGR:");
  if(str1!=NULL)
  {
    if(Sim80x.Gsm.MsgFormat == GsmMsgFormat_Text)
    {
      memset(Sim80x.Gsm.Msg,0,sizeof(Sim80x.Gsm.Msg));
      memset(Sim80x.Gsm.MsgDate,0,sizeof(Sim80x.Gsm.MsgDate));
      memset(Sim80x.Gsm.MsgNumber,0,sizeof(Sim80x.Gsm.MsgNumber));
      memset(Sim80x.Gsm.MsgTime,0,sizeof(Sim80x.Gsm.MsgTime));
      tmp_int32_t = sscanf(str1,"\r\n+CMGR: %*[^,],\"%[^\"]\",%*[^,],\"%[^,],%[^+-]%*d\"\r\n%[^\r]s\r\nOK\r\n",Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);      
      if(tmp_int32_t == 4)
        Sim80x.Gsm.MsgReadIsOK=1;
      else
        Sim80x.Gsm.MsgReadIsOK=0;
    }else if(Sim80x.Gsm.MsgFormat == GsmMsgFormat_PDU)
    {
      
    }    
  

}
}
/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsgServiceNo(uint16_t addrs)
{
  
  char      *strStart,*str1, *str2;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
 //##################################################  
  str1 = strstr(strStart,"\r\n+CSCA:");
  if(str1!=NULL)
  {
    memset(Sim80x.Gsm.MsgServiceNumber,0,sizeof(Sim80x.Gsm.MsgServiceNumber));
    str1 = strchr(str1,'"');
    str1++;
    str2 = strchr(str1,'"');
    strncpy(Sim80x.Gsm.MsgServiceNumber,str1,str2-str1);
  }
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsTextModeParam(uint16_t addrs)
{
  
  char      *strStart,*str1;
  uint32_t  tmp_int32_t;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CSMP:");
  if(str1!=NULL)
  {
    tmp_int32_t = sscanf(str1,"\r\n+CSMP: %hhd,%hhd,%hhd,%hhd\r\nOK\r\n",&Sim80x.Gsm.MsgTextModeParameterFo,&Sim80x.Gsm.MsgTextModeParameterVp,&Sim80x.Gsm.MsgTextModeParameterPid,&Sim80x.Gsm.MsgTextModeParameterDcs);
  }
 

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processBTGetHostName(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //################################################## 
  str1 = strstr(strStart,"\r\n+BTHOST:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+BTHOST: %[^,],%[^\r]",Sim80x.Bluetooth.HostName,Sim80x.Bluetooth.HostAddress);    
  }  
  

