labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processBTStatus(uint16_t addrs)
{
  
  char      *strStart, *str1, *str2, *str3;
  uint32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0]; 
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTSTATUS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Bluetooth.Status = (BluetoothStatus_t)atoi(str1);
    
    str3 = strstr(str1,"\r\nOK\r\n");
    CheckAnotherConnectedProfile:
    str2 = strstr(str1,"\r\nC:");
    if((str2 != NULL) && (str2 <str3) && (str2 > str1))
    {
      tmp_int32_t = sscanf(str2,"\r\nC: %hhd,%[^,],%[^,],%[^\r]",&Sim80x.Bluetooth.ConnectedID,Sim80x.Bluetooth.ConnectedName,Sim80x.Bluetooth.ConnectedAddress,tmp_str);       
      if(strcmp(tmp_str,"\"HFP\"")==0)
        tmp_int32_t = BluetoothProfile_HSP_HFP;
      else if(strcmp(tmp_str,"\"HSP\"")==0)
        tmp_int32_t = BluetoothProfile_HSP_HFP;
      else if(strcmp(tmp_str,"\"A2DP\"")==0)
        tmp_int32_t = BluetoothProfile_A2DP;
      else if(strcmp(tmp_str,"\"GAP\"")==0)
        tmp_int32_t = BluetoothProfile_GAP;
      else if(strcmp(tmp_str,"\"GOEP\"")==0)
        tmp_int32_t = BluetoothProfile_GOEP;
      else if(strcmp(tmp_str,"\"OPP\"")==0)
        tmp_int32_t = BluetoothProfile_OPP;
      else if(strcmp(tmp_str,"\"SDAP\"")==0)
        tmp_int32_t = BluetoothProfile_SDAP;
      else if(strcmp(tmp_str,"\"SPP\"")==0)
        tmp_int32_t = BluetoothProfile_SSP;
      else tmp_int32_t = BluetoothProfile_NotSet;
    
      for(uint8_t i=0 ;i<sizeof(Sim80x.Bluetooth.ConnectedProfile) ; i++)
      {
        if(Sim80x.Bluetooth.ConnectedProfile[i]==(BluetoothProfile_t)tmp_int32_t)
          break;
        if(Sim80x.Bluetooth.ConnectedProfile[i]==BluetoothProfile_NotSet)
        {
          Sim80x.Bluetooth.ConnectedProfile[i]=(BluetoothProfile_t)tmp_int32_t;
          break;
        }
      }
      str1+=5;
      goto CheckAnotherConnectedProfile;
    }    
  }  
   

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processBTPair(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
   //##################################################  
  str1 = strstr(strStart,"\r\n+BTPAIR:");
  if(str1!=NULL)
  {
    
  }
 


}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processBTVisibility(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0]; 
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTVIS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Bluetooth.Visibility=atoi(str1);
  }
   

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processGPRSNetApn(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
   //##################################################  
  str1 = strstr(strStart,"\r\n+CSTT:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+CSTT: \"%[^\"]\",\"%[^\"]\",\"%[^\"]\"\r\n",Sim80x.GPRS.APN,Sim80x.GPRS.APN_UserName,Sim80x.GPRS.APN_Password);    
  }
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processGPRSNetLocalIP(uint16_t addrs)
{
  
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];
  //##################################################  
  str1 = strstr(strStart,"AT+CIFSR\r\r\n");
  if(str1!=NULL)
  {
    sscanf(str1,"AT+CIFSR\r\r\n%[^\r]",Sim80x.GPRS.LocalIP);
  } 
    

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processGPRSNetMultiConnection(uint16_t addrs)
{
  
  char      *strStart, *str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

//##################################################  
  str1 = strstr(strStart,"\r\n+CIPMUX:");
  if(str1!=NULL)
  {
    str1 =strchr(str1,':');
    str1++;
    if(atoi(str1)==0)
      Sim80x.GPRS.MultiConnection=0;
    else
      Sim80x.GPRS.MultiConnection=1;
  } 
  
}

/****************************************************************
*FUNCTION NAME:processIMEI
*FUNCTION     :processIMEI
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processIMEI(uint16_t addrs)
{
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGSN\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGSN\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getIMEI");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

#endif

#endif
